text/chart_style/c5_fibonacci.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="jp" xml:lang="jp">
<head>
<!-- 2019-10-09 水 14:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>テスト駆動でFibonacci &#x2013; fib(n) = fib(n-1)+fib(n-2)</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="西谷滋人" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">テスト駆動でFibonacci &#x2013; fib(n) = fib(n-1)+fib(n-2)</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga353607">1. TDD一番め</a></li>
<li><a href="#org8bf7a58">2. fib(0) = 0</a></li>
<li><a href="#orgd0ce473">3. fib(1) =1</a></li>
<li><a href="#orgb9c61dc">4. fib(2) = fib(1) + fib(0) = 1</a></li>
<li><a href="#org6bb73d7">5. refactoring</a></li>
<li><a href="#orga144bca">6. fib(3) = 2 = fib(2) + fib(1)</a></li>
<li><a href="#org6ed2f05">7. fib(4) = fib(3) + fib(2) = 2 + 1 = 3</a></li>
</ul>
</div>
</div>

<div id="outline-container-orga353607" class="outline-2">
<h2 id="orga353607"><span class="section-number-2">1</span> TDD一番め</h2>
<div class="outline-text-2" id="text-1">
<p>
Fibonacci数列
</p>
<pre class="example">
fib(n) = fib(n-1)+fib(n-2)
0 1 1 2 3 5 8 13 21 ...

</pre>
<p>
をrecursion(再帰的)で求める問題をTDDで解いていく様子を示します．
assert_equal.rbをcodesにcopyしておいてください．
</p>

<p>
以下はTDDのバイブルのKent Beck本に載っていたののアレンジです．
</p>
</div>
</div>
<div id="outline-container-org8bf7a58" class="outline-2">
<h2 id="org8bf7a58"><span class="section-number-2">2</span> fib(0) = 0</h2>
<div class="outline-text-2" id="text-2">
<p>
Fibonacci数列の初項は0です．
まずは表示させてみます．
</p>
<div class="org-src-container">
<pre class="src src-ruby">p fib(0)
</pre>
</div>
<p>
ないよね．
</p>

<p>
そこで，defします．
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">fib</span>(n)
  <span style="color: #a020f0;">if</span> n==0
    <span style="color: #a020f0;">return</span> 0
  <span style="color: #a020f0;">end</span>
<span style="color: #a020f0;">end</span>
</pre>
</div>

<p>
assert_equal.rbのassertion(確認)を試しておきます．
</p>
<div class="org-src-container">
<pre class="src src-ruby">require <span style="color: #8b2252;">'./assert_equal'</span>
puts assert_equal(0, fib(0))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd0ce473" class="outline-2">
<h2 id="orgd0ce473"><span class="section-number-2">3</span> fib(1) =1</h2>
<div class="outline-text-2" id="text-3">
<p>
次はfib(1)=1
</p>

<p>
まずはassertion
</p>
<div class="org-src-container">
<pre class="src src-ruby">puts assert_equal(1, fib(1))
</pre>
</div>
<p>
もちろん失敗するが．．．
まずはコピペ．
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">fib</span>(n)
  <span style="color: #a020f0;">if</span> n==0
    <span style="color: #a020f0;">return</span> 0
  <span style="color: #a020f0;">end</span>
  <span style="color: #a020f0;">if</span> n==1
    <span style="color: #a020f0;">return</span> 1
  <span style="color: #a020f0;">end</span>
<span style="color: #a020f0;">end</span>
</pre>
</div>
<p>
これで通る．
</p>

<p>
テスト側の重複が気になってきたので，配列にしよう．
</p>
<div class="org-src-container">
<pre class="src src-ruby">[[0,0],[1,1]].each <span style="color: #a020f0;">do</span> |pair|
  puts assert_equal(pair[0], fib(pair[1]))
<span style="color: #a020f0;">end</span>
</pre>
</div>
<p>
テストはもちろんgreen.
</p>
</div>
</div>
<div id="outline-container-orgb9c61dc" class="outline-2">
<h2 id="orgb9c61dc"><span class="section-number-2">4</span> fib(2) = fib(1) + fib(0) = 1</h2>
<div class="outline-text-2" id="text-4">
<p>
人間は賢いからheadみたいに書いても納得するけど，computerはだめ．
</p>

<p>
まずはテスト
</p>
<div class="org-src-container">
<pre class="src src-ruby">[[0,0],[1,1],[2,1]].each <span style="color: #a020f0;">do</span> |pair|
</pre>
</div>
<p>
なんですが，これはred.
</p>
<pre class="example">
&gt; ruby fibonacci_2.rb
expeced:0
result :0
succeeded in assert_equal 0 should be expected.

expeced:1
result :1
succeeded in assert_equal 1 should be expected.

expeced:2
result :1
failed in assert_equal 1 should be expected.
</pre>

<p>
条件分岐をもう少しいじって，
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">fib</span>(n)
  <span style="color: #a020f0;">if</span> n==0
    <span style="color: #a020f0;">return</span> 0
  <span style="color: #a020f0;">end</span>
  <span style="color: #a020f0;">if</span> n&lt;=2
    <span style="color: #a020f0;">return</span> 1
  <span style="color: #a020f0;">end</span>
<span style="color: #a020f0;">end</span>
</pre>
</div>
<p>
これで動くはず&#x2026; おやおや．
実は，assert_equalは(expect, result)とうけとっています．
</p>
<pre class="example">
result = fib(2)
expected = 1

</pre>
<p>
だから，テストは配列変数pairの示数indexが逆で，
</p>
<div class="org-src-container">
<pre class="src src-ruby">require <span style="color: #8b2252;">'./assert_equal'</span>
[[0,0],[1,1],[2,1]].each <span style="color: #a020f0;">do</span> |pair|
  puts assert_equal(pair[1], fib(pair[0]))
<span style="color: #a020f0;">end</span>
</pre>
</div>
<p>
が正解．そうするとgreen.
</p>

<p>
もう少し配列の受け取りを明示的にすると，
</p>
<pre class="example">
index, expected = pair

</pre>
<p>
と修正できて
</p>
<div class="org-src-container">
<pre class="src src-ruby">require <span style="color: #8b2252;">'./assert_equal'</span>
[[0,0],[1,1],[2,1]].each <span style="color: #a020f0;">do</span> |index, expected|
  puts assert_equal(expected, fib(index))
<span style="color: #a020f0;">end</span>
</pre>
</div>
<p>
の方がいいかも．
</p>
</div>
</div>

<div id="outline-container-org6bb73d7" class="outline-2">
<h2 id="org6bb73d7"><span class="section-number-2">5</span> refactoring</h2>
<div class="outline-text-2" id="text-5">
<p>
ここらへんまで来るとcodeがごちゃついてきた感じしません？
しない？　それは頭のいい人．私には無理．
えっと，rubocopという汚いcodeの取り締まり警官は10行以上のmethodがあると，
烈火のごとく怒ります．
</p>

<p>
治しようがないと思わずに削減を考えます．
求めよさらば与えられん．そんなに無理しなくても，
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">fib</span>(n)
  <span style="color: #a020f0;">return</span> 0 <span style="color: #a020f0;">if</span> n==0
  <span style="color: #a020f0;">return</span> 1 <span style="color: #a020f0;">if</span> n&lt;=2
<span style="color: #a020f0;">end</span>
</pre>
</div>
<p>
と2行に削減できます．この記法も英語的でしょ．
それがrubyのいいところ．
これだと何をしているのか一目瞭然でしょ．
動いた部分を隠すというのを前回やりましたが，
こっちの方がスマートです．
こういうのをrefactoring(因数分解をもう一度)っていいます．
</p>
</div>
</div>

<div id="outline-container-orga144bca" class="outline-2">
<h2 id="orga144bca"><span class="section-number-2">6</span> fib(3) = 2 = fib(2) + fib(1)</h2>
<div class="outline-text-2" id="text-6">
<p>
次はn = 3. テストは，
</p>
<pre class="example">
[[0,0],[1,1],[2,1],[3,2]].each do |index, expected|

</pre>
<p>
です．sourceは
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">fib</span>(n)
  <span style="color: #a020f0;">return</span> 0  <span style="color: #a020f0;">if</span> n==0
  <span style="color: #a020f0;">return</span> 1  <span style="color: #a020f0;">if</span> n&lt;=2
  <span style="color: #a020f0;">return</span> 2
<span style="color: #a020f0;">end</span>
</pre>
</div>
<p>
え．．．としてもいいんですよ．
それがtddです．まずはgreenにする．
</p>

<p>
そのあとでcodeを修正します．return 2の意味を考えると
</p>
<pre class="example">
return 1+1

</pre>
<p>
ですよね．さらには
</p>
<pre class="example">
return fib(2) + fib(1)

</pre>
<p>
というのも気がつくはず．
そうするとcodeは
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">fib</span>(n)
  <span style="color: #a020f0;">return</span> 0  <span style="color: #a020f0;">if</span> n==0
  <span style="color: #a020f0;">return</span> 1  <span style="color: #a020f0;">if</span> n&lt;=2
  <span style="color: #a020f0;">return</span> fib(2) + fib(1)
<span style="color: #a020f0;">end</span>
</pre>
</div>
<p>
です．これで通るのが不思議かもしれませんが，とおりますし，意味も
okです．
</p>
</div>
</div>

<div id="outline-container-org6ed2f05" class="outline-2">
<h2 id="org6ed2f05"><span class="section-number-2">7</span> fib(4) = fib(3) + fib(2) = 2 + 1 = 3</h2>
<div class="outline-text-2" id="text-7">
<p>
次は4. 期待値は3ですね．
</p>
<pre class="example">
[[0,0],[1,1],[2,1],[3,2],[4,3]].each do |index, expected|

</pre>
<p>
としましょう．テストはもちろんredです．
最後のreturnを定義通り
</p>
<pre class="example">
fib(n) = fib(n-1) + fib(n-2)

</pre>
<p>
と修正しましょう．
</p>

<p>
そうするとあら不思議．通ります．
</p>

<p>
そのさき1,1,2,3,5,8,13,21ももちろん．
</p>

<p>
ただ一つ抜けているのは，
</p>
<pre class="example">
fib(2) = fib(1) + fib(0) = 1 + 0

</pre>
<p>
なんで，fibのなかの条件分岐はもう少し狭められて，
</p>
<pre class="example">
return 1  if n == 1

</pre>
<p>
で十分ということがわかります．
</p>

<p>
そうすると最終形は，
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">fib</span>(n)
  <span style="color: #a020f0;">return</span> 0 <span style="color: #a020f0;">if</span> n==0
  <span style="color: #a020f0;">return</span> 1 <span style="color: #a020f0;">if</span> n==1
  <span style="color: #a020f0;">return</span> fib(n-1) + fib(n-2)
<span style="color: #a020f0;">end</span>

require <span style="color: #8b2252;">'./assert_equal'</span>
[[0,0],[1,1],[2,1],[3,2],[4,3],
[5,5],[6,8],[7,13],[8,21]].each <span style="color: #a020f0;">do</span> |index, expected|
  puts assert_equal(expected, fib(index))
<span style="color: #a020f0;">end</span>
</pre>
</div>
<p>
です．
</p>

<p>
うーーーん．こんなに綺麗にFibonacciを説明できるなんて．TDD万歳!!
「TDD死すとも，テスティングは死せず」
"TDD is dead.  Long live tesing." by David Heinemeier Hansson
ってのもありますが．．．
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 西谷滋人</p>
<p class="date">Created: 2019-10-09 水 14:53</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
